uhnp/src/Catalogs/СтанцииУправленияЗаказамиИСМП/СтанцииУправленияЗаказамиИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтанцииУправленияЗаказамиИСМП</name>
  <attributes>
    <name>Идентификатор</name>
    <comment>Идентификатор СУЗ</comment>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматОбмена</name>
    <type>
      <types>EnumRef.ВерсииФорматаОбменаСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Enums/ВерсииФорматаОбменаСУЗ/ВерсииФорматаОбменаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВерсииФорматаОбменаСУЗ</name>
  <enumValues>
    <name>V1</name>
  </enumValues>
  <enumValues>
    <name>V2</name>
  </enumValues>
  <enumValues>
    <name>V3</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/СтанцииУправленияЗаказамиИСМП/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриСозданииЧтенииНаСервере();
	КонецЕсли;
		
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииЧтенииНаСервере();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	Элементы.ФорматОбмена.РежимВыбораИзСписка = Истина;
	Элементы.ФорматОбмена.СписокВыбора.Очистить();
	Элементы.ФорматОбмена.СписокВыбора.Добавить(Перечисления.ВерсииФорматаОбменаСУЗ.V3);

	Если ЗначениеЗаполнено(Объект.ФорматОбмена)
		И Элементы.ФорматОбмена.СписокВыбора.НайтиПоЗначению(Объект.ФорматОбмена) = Неопределено Тогда
		Элементы.ФорматОбмена.СписокВыбора.Добавить(Объект.ФорматОбмена);
		Элементы.ФорматОбмена.СписокВыбора.СортироватьПоЗначению();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
